HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8ax.h
/**
 * @file config_stc8ax.h
 * @author MContour (m-contour@qq.com)
 * @brief core and peripheral definition for stc8x 
 * @details This file contains all the peripheral register's definitions, bits 
 *          definitions and memory mapping for STC8x Connectivity line.
 * @version 0.1
 * @date 2022-04-27
 * 
 * @copyright Apache 2.0 LICENSE
 * 
 *****************************************************************************
 * Copyright (c) [2022-04-27] [MContour m-contour@qq.com]
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 *     http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *****************************************************************************
 */
#ifndef __CONFIG_STC8AX_H__
#define __CONFIG_STC8AX_H__
//包含本头文件后,不用另外再包含"REG51.H"

/**
 * @defgroup Special_function_registers
 * Special function registers locate at the expension RAM area.
 * If you want to read/write the special function registers, the BIT7 of P_SW2 needs to be set as 1.
 */

/** @addtogroup STC
 * @{
 */

/** @defgroup Core
 * @{
 */


//! kernel special function register setting 
sfr ACC         =   0xe0;
sfr B           =   0xf0;
sfr PSW         =   0xd0;
sfr SP          =   0x81;
sfr DPL         =   0x82;
sfr DPH         =   0x83;
sfr TA          =   0xae;
sfr DPS         =   0xe3;
sfr DPL1        =   0xe4;
sfr DPH1        =   0xe5;

sbit CY         =   PSW^7;
sbit AC         =   PSW^6;
sbit F0         =   PSW^5;
sbit RS1        =   PSW^4;
sbit RS0        =   PSW^3;
sbit OV         =   PSW^2;
sbit F1         =   PSW^1;
sbit P          =   PSW^0;

/** @defgroup Peripheral_memory_map
 * @{
 */

//! system management special function register setting 
/* bus speed control register setting */
#define     BUS_SPEED_ADDR              ((uint8_t)0xA1)

/* Bit definition for BUS_SPEED registor */
#define     BUS_SPEED_RW_S              ((uint8_t)0xC0) /*!< RW_S[1:0] bits (control line selection) */
#define     BUS_SPEED_RW_S_0            ((uint8_t)0x40) /*!< Bit 0 */
#define     BUS_SPEED_RW_S_1            ((uint8_t)0x80) /*!< Bit 1 */

#define     BUS_SPEED_SPEED             ((uint8_t)0x03) /*!< SPEED[1:0] bits (bus read/write speed control) */
#define     BUS_SPEED_SPEED_0           ((uint8_t)0x01) /*!< Bit 0 */
#define     BUS_SPEED_SPEED_1           ((uint8_t)0x02) /*!< Bit 1 */

sfr BUS_SPEED   =   BUS_SPEED_ADDR; //! bus speed control register

/*  auxiliary register setting */
#define     AUXR_ADDR                   ((uint8_t)0x8E)
sfr AUXR        =   AUXR_ADDR;      //! auxiliary register

/* peripheral port switch register setting */
#define     PERIPHERAL_PORT_SW1_ADDR    ((uint8_t)0xA2)
#define     PERIPHERAL_PORT_SW2_ADDR    ((uint8_t)0xBA)

/* Bit definition for P_SW1 registor */
#define     P_SW1_S1_S                  ((uint8_t)0xC0) /*!< S1_S[1:0] bits (serial port 1 function pins selection) */
#define     P_SW1_S1_S_0                ((uint8_t)0x40) /*!< Bit 0 TxD */
#define     P_SW1_S1_S_1                ((uint8_t)0x80) /*!< Bit 1 RxD */

#define     P_SW1_CCP_S                 ((uint8_t)0x30) /*!< CCP_S[1:0] bits (PCA function pins selection) */
#define     P_SW1_CCP_S_0               ((uint8_t)0x10) /*!< Bit 0 */
#define     P_SW1_CCP_S_1               ((uint8_t)0x20) /*!< Bit 1 */

#define     P_SW1_SPI_S                 ((uint8_t)0x0C) /*!< SPI_S[1:0] bits (SPI function pins selection) */
#define     P_SW1_SPI_S_0               ((uint8_t)0x04) /*!< Bit 0 */
#define     P_SW1_SPI_S_1               ((uint8_t)0x08) /*!< Bit 1 */

#define     P_SW2_EAXFR                 ((uint8_t)0x80) /*!< XFR control register */

#define     P_SW2_I2C_S                 ((uint8_t)0x30) /*!< I2C_S[1:0] bits (I2C function pins selection) */
#define     P_SW2_I2C_S_0               ((uint8_t)0x10) /*!< Bit 0 SDA */
#define     P_SW2_I2C_S_1               ((uint8_t)0x20) /*!< Bit 1 SCL */

#define     P_SW2_CMPO_S                ((uint8_t)0x08) /*!< CMPO selection */

#define     P_SW2_S4_S                  ((uint8_t)0x04) /*!< serial port 4 function pins selection */

#define     P_SW2_S3_S                  ((uint8_t)0x02) /*!< serial port 3 function pins selection */

#define     P_SW2_S2_S                  ((uint8_t)0x01) /*!< serial port 2 function pins selection */

sfr P_SW1       =   PERIPHERAL_PORT_SW1_ADDR;
sfr P_SW2       =   PERIPHERAL_PORT_SW2_ADDR;

/**
 * @brief system clock control interface
 * 
 */
typedef struct
{
    __IO uint8_t RCC_CKSEL;
    __IO uint8_t RCC_CLKDIV;
    __IO uint8_t RCC_IRC24MCR;
    __IO uint8_t RCC_XOSCCR;
    __IO uint8_t RCC_IRC32KCR;
} SYSCLK_TypeDef;

//! system clock special function register setting in internal expansion RAM 
/* internel oscillator frequency control and adjustment registers*/
#define     IRTRIM_ADDR                 ((uint8_t)0x9F)
#define     LIRTRIM_ADDR                ((uint8_t)0x9E)

/* Bit definition for LIRTRIM registor */
#define     LIRTRIM_BITS                ((uint8_t)0x03)
#define     LIRTRIM_BITS_0              ((uint8_t)0x01)
#define     LIRTRIM_BITS_1              ((uint8_t)0x02)

sfr IRTRIM      =   IRTRIM_ADDR;    //! internal IRC frequency adjustment register
sfr LIRTRIM     =   LIRTRIM_ADDR;   //! internal IRC frequency subtle adjustment register

/* system clock base address */
#define     SYSCLK_BASE     ((uint16_t)0xFE00)
#define     CKSEL_ADDR      (SYSCLK_BASE + 0x0000)
#define     CLKDIV_ADDR     (SYSCLK_BASE + 0x0001)
#define     IRC24MCR_ADDR   (SYSCLK_BASE + 0x0002)
#define     XOSCCR_ADDR     (SYSCLK_BASE + 0x0003)
#define     IRC32KCR_ADDR   (SYSCLK_BASE + 0x0004)

#define     CKSEL_MCLKODIV_0            ((uint16_t)0x0000)

/**
 * @brief define the SYSCLK type
 * @note To access XDATA peripherals, use the `volatile` keyword to ensure 
 * that the C compiler does not optimize out necessary memory accesses.
 */
#define     SYSCLK          ((SYSCLK_TypeDef xdata *) SYSCLK_BASE)

