HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8ax.h
#define     CKSEL           ((__IO uint8_t xdata *)   CKSEL_ADDR)     //!< system clock selection
#define     CLKDIV          ((__IO uint8_t xdata *)   CLKDIV_ADDR)    //!< system clock division
#define     IRC24MCR        ((__IO uint8_t xdata *)   IRC24MCR_ADDR)  //!< internal 24MHz oscillator control
#define     XOSCCR          ((__IO uint8_t xdata *)   XOSCCR_ADDR)    //!< external oscillator control
#define     IRC32KCR        ((__IO uint8_t xdata *)   IRC32KCR_ADDR)  //!< internal 32kHz oscillator control

//! system power special function register setting
/* power control base address */
#define     PCON_ADDR       0x87
#define     VOCTRL_ADDR     0xBB
sfr PCON        =   PCON_ADDR;
sfr VOCTRL      =   VOCTRL_ADDR;

//! system reset special function register control
/* reset control base address */
#define     WDT_ADDR         0xC1u
// #define     IAP_ADDR      0xC7u
#define     RSTCFG_ADDR      0xFFu

/* Bit definition for WDT_CONTR registor */
#define     WDT_FLAG         0x80
#define     EN_WDT           0x20
#define     CLR_WDT          0x10
#define     IDL_WDT          0x08

sfr WDT_CONTR   =   WDT_ADDR;
// sfr IAP_CONTR   =   IAP_ADDR;
sfr RSTCFG      =   RSTCFG_ADDR;

/* wake up timer base address */
#define     WKT_BASE        0xAAu
#define     WKTCL_ADDR      (WKT_BASE + 0x0000u)
#define     WKTCH_ADDR      (WKT_BASE + 0x0001u)

/* WKTCH offset */
#define WKTEN       0x80

sfr WKTCL       =   WKTCL_ADDR;
sfr WKTCH       =   WKTCH_ADDR;

//! GPIO peripherals
#define     GPIO_BASE       0x80u
#define     PxM0_BASE       0x94u
#define     PxM1_BASE       0x93u
#define     PxPU_BASE       0xFE10u
#define     PxNCS_BASE      0xFE18u

/* GPIO address definition */
#define     P0_ADDR         (GPIO_BASE + 0x00u) 
#define     P1_ADDR         (GPIO_BASE + 0x10u) 
#define     P2_ADDR         (GPIO_BASE + 0x20u) 
#define     P3_ADDR         (GPIO_BASE + 0x30u) 
#define     P4_ADDR         (GPIO_BASE + 0x40u) 
#define     P5_ADDR         (GPIO_BASE + 0x48u) 
#define     P6_ADDR         (GPIO_BASE + 0x68u) 
#define     P7_ADDR         (GPIO_BASE + 0x78u) 

/* PxM0: GPIO configuration registers 0 address definition */
#define     P0M0_ADDR       PxM0_BASE 
#define     P1M0_ADDR       0x92u
#define     P2M0_ADDR       0x96u
#define     P3M0_ADDR       0xB2u
#define     P4M0_ADDR       0xB4u
#define     P5M0_ADDR       0xCAu
#define     P6M0_ADDR       0xCCu
#define     P7M0_ADDR       0xE2u

/* PxM1: GPIO configuration registers 1 address definition */
#define     P0M1_ADDR       PxM1_BASE 
#define     P1M1_ADDR       0x91u
#define     P2M1_ADDR       0x95u
#define     P3M1_ADDR       0xB1u
#define     P4M1_ADDR       0xB3u
#define     P5M1_ADDR       0xC9u
#define     P6M1_ADDR       0xCBu
#define     P7M1_ADDR       0xE1u

/* GPIO pull up resistor control register address definition */
#define     P0PU_ADDR        (PxPU_BASE + 0x00u)
#define     P1PU_ADDR        (PxPU_BASE + 0x01u)
#define     P2PU_ADDR        (PxPU_BASE + 0x02u)
#define     P3PU_ADDR        (PxPU_BASE + 0x03u)
#define     P4PU_ADDR        (PxPU_BASE + 0x04u)
#define     P5PU_ADDR        (PxPU_BASE + 0x05u)
#define     P6PU_ADDR        (PxPU_BASE + 0x06u)
#define     P7PU_ADDR        (PxPU_BASE + 0x07u)

/*GPIO schmidt trigger control register address definition */

#define    P0NCS_ADDR       (PxNCS_BASE + 0x00u)
#define    P1NCS_ADDR       (PxNCS_BASE + 0x01u)
#define    P2NCS_ADDR       (PxNCS_BASE + 0x02u)
#define    P3NCS_ADDR       (PxNCS_BASE + 0x03u)
#define    P4NCS_ADDR       (PxNCS_BASE + 0x04u)
#define    P5NCS_ADDR       (PxNCS_BASE + 0x05u)
#define    P6NCS_ADDR       (PxNCS_BASE + 0x06u)
#define    P7NCS_ADDR       (PxNCS_BASE + 0x07u)


/* GPIO registers */
sfr P0          =   P0_ADDR;
sfr P1          =   P1_ADDR;
sfr P2          =   P2_ADDR;
sfr P3          =   P3_ADDR;
sfr P4          =   P4_ADDR;
sfr P5          =   P5_ADDR;
sfr P6          =   P6_ADDR;
sfr P7          =   P7_ADDR;

/* GPIO configuration registers 0 */
sfr P0M0        =   P0M0_ADDR;
sfr P1M0        =   P1M0_ADDR;
sfr P2M0        =   P2M0_ADDR;
sfr P3M0        =   P3M0_ADDR;
sfr P4M0        =   P4M0_ADDR;
sfr P5M0        =   P5M0_ADDR;
sfr P6M0        =   P6M0_ADDR;
sfr P7M0        =   P7M0_ADDR;

/* GPIO configuration registers 1 */
sfr P0M1        =   P0M1_ADDR;
sfr P1M1        =   P1M1_ADDR;
sfr P2M1        =   P2M1_ADDR;
sfr P3M1        =   P3M1_ADDR;
sfr P4M1        =   P4M1_ADDR;
sfr P5M1        =   P5M1_ADDR;
sfr P6M1        =   P6M1_ADDR;
sfr P7M1        =   P7M1_ADDR;

/* specific pins of GPIO registers */
sbit P00        =   P0^0;
sbit P01        =   P0^1;
sbit P02        =   P0^2;
sbit P03        =   P0^3;
sbit P04        =   P0^4;
sbit P05        =   P0^5;
sbit P06        =   P0^6;
sbit P07        =   P0^7;
sbit P10        =   P1^0;
sbit P11        =   P1^1;
sbit P12        =   P1^2;
sbit P13        =   P1^3;
sbit P14        =   P1^4;
sbit P15        =   P1^5;
sbit P16        =   P1^6;
sbit P17        =   P1^7;
sbit P20        =   P2^0;
sbit P21        =   P2^1;
sbit P22        =   P2^2;
sbit P23        =   P2^3;
sbit P24        =   P2^4;
sbit P25        =   P2^5;
sbit P26        =   P2^6;
sbit P27        =   P2^7;
sbit P30        =   P3^0;
sbit P31        =   P3^1;
sbit P32        =   P3^2;
sbit P33        =   P3^3;
sbit P34        =   P3^4;
sbit P35        =   P3^5;
sbit P36        =   P3^6;
sbit P37        =   P3^7;
sbit P40        =   P4^0;
sbit P41        =   P4^1;
sbit P42        =   P4^2;
sbit P43        =   P4^3;
sbit P44        =   P4^4;
sbit P45        =   P4^5;
sbit P46        =   P4^6;
sbit P47        =   P4^7;
sbit P50        =   P5^0;
sbit P51        =   P5^1;
sbit P52        =   P5^2;
sbit P53        =   P5^3;
sbit P54        =   P5^4;
sbit P55        =   P5^5;
sbit P56        =   P5^6;
sbit P57        =   P5^7;
sbit P60        =   P6^0;
sbit P61        =   P6^1;
sbit P62        =   P6^2;
sbit P63        =   P6^3;
sbit P64        =   P6^4;
sbit P65        =   P6^5;
sbit P66        =   P6^6;
sbit P67        =   P6^7;
sbit P70        =   P7^0;
sbit P71        =   P7^1;
sbit P72        =   P7^2;
sbit P73        =   P7^3;
sbit P74        =   P7^4;
sbit P75        =   P7^5;
sbit P76        =   P7^6;
sbit P77        =   P7^7;

/* GPIO control register */
#define     P0PU        (*(__IO uint8_t xdata *) P0PU_ADDR)             // Extended SFR
#define     P1PU        (*(__IO uint8_t xdata *) P1PU_ADDR)             // Extended SFR
#define     P2PU        (*(__IO uint8_t xdata *) P2PU_ADDR)             // Extended SFR
#define     P3PU        (*(__IO uint8_t xdata *) P3PU_ADDR)             // Extended SFR
#define     P4PU        (*(__IO uint8_t xdata *) P4PU_ADDR)             // Extended SFR
#define     P5PU        (*(__IO uint8_t xdata *) P5PU_ADDR)             // Extended SFR
#define     P6PU        (*(__IO uint8_t xdata *) P6PU_ADDR)             // Extended SFR
#define     P7PU        (*(__IO uint8_t xdata *) P7PU_ADDR)             // Extended SFR

