HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8ax.h
#define     P0NCS       (*(__IO uint8_t xdata *) P1NCS_ADDR)            // Extended SFR
#define     P1NCS       (*(__IO uint8_t xdata *) P2NCS_ADDR)            // Extended SFR
#define     P2NCS       (*(__IO uint8_t xdata *) P3NCS_ADDR)            // Extended SFR
#define     P3NCS       (*(__IO uint8_t xdata *) P4NCS_ADDR)            // Extended SFR
#define     P4NCS       (*(__IO uint8_t xdata *) P5NCS_ADDR)            // Extended SFR
#define     P5NCS       (*(__IO uint8_t xdata *) P6NCS_ADDR)            // Extended SFR
#define     P6NCS       (*(__IO uint8_t xdata *) P7NCS_ADDR)            // Extended SFR
#define     P7NCS       (*(__IO uint8_t xdata *) P8NCS_ADDR)            // Extended SFR
/** @} */

//! ISR peripherals
/* ISR base address */
#define    IE_ADDR          0xA8u
#define    IE2_ADDR         0xAFu
#define    IP_ADDR          0xB8u
#define    IP2_ADDR         0xB5u
#define    IPH_ADDR         0xB7u
#define    IP2H_ADDR        0xB6u
#define    INTCLKO_ADDR     0x8Fu
#define    AUXINTIF_ADDR    0xEFu

/* IE2 offset */
#define     ET4             0x40u
#define     ET3             0x20u
#define     ES4             0x10u
#define     ES3             0x08u
#define     ET2             0x04u
#define     ESPI            0x02u
#define     ES2             0x01u

/* IP2 offset */
#define     PI2C            0x40u
#define     PCMP            0x20u
#define     PX4             0x10u
#define     PPWMFD          0x08u
#define     PPWM            0x04u
#define     PSPI            0x02u
#define     PS2             0x01u

/* IPH offset */
#define     PPCAH           0x80u
#define     PLVDH           0x40u
#define     PADCH           0x20u
#define     PSH             0x10u
#define     PT1H            0x08u
#define     PX1H            0x04u
#define     PT0H            0x02u
#define     PX0H            0x01u

/* IP2H offset */
#define     PI2CH           0x40u
#define     PCMPH           0x20u
#define     PX4H            0x10u
#define     PPWMFDH         0x08u
#define     PPWMH           0x04u
#define     PSPIH           0x02u
#define     PS2H            0x01u

/* INTCLKO offset */
#define     EX4             0x40u
#define     EX3             0x20u
#define     EX2             0x10u
#define     T2CLKO          0x04u
#define     T1CLKO          0x02u
#define     T0CLKO          0x01u

/* AUXINTIF offset */
#define     INT4IF          0x40u
#define     INT3IF          0x20u
#define     INT2IF          0x10u
#define     T4IF            0x04u
#define     T3IF            0x02u
#define     T2IF            0x01u

/* ISR register */
sfr IE          =   IE_ADDR;
sfr IE2         =   IE2_ADDR;
sfr IP          =   IP_ADDR;
sfr IP2         =   IP2H_ADDR;
sfr IPH         =   IPH_ADDR;
sfr IP2H        =   IP2H_ADDR;
sfr INTCLKO     =   INTCLKO_ADDR;
sfr AUXINTIF    =   AUXINTIF_ADDR;


// IE BITs (interuption enabling register)
sbit EA         =   IE^7;
sbit ELVD       =   IE^6;
sbit EADC       =   IE^5;
sbit ES         =   IE^4;
sbit ET1        =   IE^3;
sbit EX1        =   IE^2;
sbit ET0        =   IE^1;
sbit EX0        =   IE^0;

// IP BITs
sbit PPCA       =   IP^7;
sbit PLVD       =   IP^6;
sbit PADC       =   IP^5;
sbit PS         =   IP^4;
sbit PT1        =   IP^3;
sbit PX1        =   IP^2;
sbit PT0        =   IP^1;
sbit PX0        =   IP^0;

//! Timer peripherals
/* timer basic address definition */
#define     Timer_BASE      0x88u
#define     T2T3T4_BASE     0xD1u
#define     TCON_ADDR       (Timer_BASE + 0x00u)
#define     TMOD_ADDR       (Timer_BASE + 0x01u)
#define     TL0_ADDR        (Timer_BASE + 0x02u)
#define     TL1_ADDR        (Timer_BASE + 0x03u)
#define     TH0_ADDR        (Timer_BASE + 0x04u)
#define     TH1_ADDR        (Timer_BASE + 0x05u)
#define     T4T3M_ADDR      (T2T3T4_BASE + 0x00u)
#define     T4H_ADDR        (T2T3T4_BASE + 0x01u)
#define     T4L_ADDR        (T2T3T4_BASE + 0x02u)
#define     T3H_ADDR        (T2T3T4_BASE + 0x03u)
#define     T3L_ADDR        (T2T3T4_BASE + 0x04u)
#define     T2H_ADDR        (T2T3T4_BASE + 0x05u)
#define     T2L_ADDR        (T2T3T4_BASE + 0x06u)

/* TMOD offset */
#define     T1_GATE         0x80
#define     T1_CT           0x40
#define     T1_M1           0x20
#define     T1_M0           0x10
#define     T0_GATE         0x08
#define     T0_CT           0x04
#define     T0_M1           0x02
#define     T0_M0           0x01

/* T4T3M offset */
#define     T4R             0x80
#define     T4_CT           0x40
#define     T4x12           0x20
#define     T4CLKO          0x10
#define     T3R             0x08
#define     T3_CT           0x04
#define     T3x12           0x02
#define     T3CLKO          0x01

/* timer special function registers */
sfr TCON        =   TCON_ADDR;
sfr TMOD        =   TMOD_ADDR;
sfr TL0         =   TL0_ADDR;
sfr TL1         =   TL1_ADDR;
sfr TH0         =   TH0_ADDR;
sfr TH1         =   TH1_ADDR;
sfr T4T3M       =   T4T3M_ADDR;
sfr T4H         =   T4H_ADDR;
sfr T4L         =   T4L_ADDR;
sfr T3H         =   T3H_ADDR;
sfr T3L         =   T3L_ADDR;
sfr T2H         =   T2H_ADDR;
sfr T2L         =   T2L_ADDR;

/* TCON BITs setting */
sbit TF1        =   TCON^7;
sbit TR1        =   TCON^6;
sbit TF0        =   TCON^5;
sbit TR0        =   TCON^4;
sbit IE1        =   TCON^3;
sbit IT1        =   TCON^2;
sbit IE0        =   TCON^1;
sbit IT0        =   TCON^0;

//! UART peripherals
/* UART basic address definition */
#define     SCON_ADDR       0x98u
#define     SBUF_ADDR       0x99u
#define     S2CON_ADDR      0x9Au
#define     S2BUF_ADDR      0x9Bu
#define     S3CON_ADDR      0xACu
#define     S3BUF_ADDR      0xADu
#define     S4CON_ADDR      0x84u
#define     S4BUF_ADDR      0x85u
#define     SADDR_ADDR      0xA9u
#define     SADEN_ADDR      0xB9u

/* S2CON offset */
#define     S2SM0           0x80u
#define     S2ST4           0x40u
#define     S2SM2           0x20u
#define     S2REN           0x10u
#define     S2TB8           0x08u
#define     S2RB8           0x04u
#define     S2TI            0x02u
#define     S2RI            0x01u

/* S3CON offset */
#define     S3SM0           0x80u
#define     S3ST4           0x40u
#define     S3SM2           0x20u
#define     S3REN           0x10u
#define     S3TB8           0x08u
#define     S3RB8           0x04u
#define     S3TI            0x02u
#define     S3RI            0x01u

