HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8ax.h
/* S4CON offset */
#define     S4SM0           0x80u
#define     S4ST4           0x40u
#define     S4SM2           0x20u
#define     S4REN           0x10u
#define     S4TB8           0x08u
#define     S4RB8           0x04u
#define     S4TI            0x02u
#define     S4RI            0x01u

/* UART special function registers */
sfr SCON        =   SCON_ADDR;
sfr SBUF        =   SBUF_ADDR; 
sfr S2CON       =   S2CON_ADDR;
sfr S2BUF       =   S2BUF_ADDR;
sfr S3CON       =   S3CON_ADDR;
sfr S3BUF       =   S3BUF_ADDR;
sfr S4CON       =   S4CON_ADDR;
sfr S4BUF       =   S4BUF_ADDR;
sfr SADDR       =   SADDR_ADDR;
sfr SADEN       =   SADEN_ADDR;

/* SCON BITs */
sbit SM0        =   SCON^7;
sbit SM1        =   SCON^6;
sbit SM2        =   SCON^5;
sbit REN        =   SCON^4;
sbit TB8        =   SCON^3;
sbit RB8        =   SCON^2;
sbit TI         =   SCON^1;
sbit RI         =   SCON^0;

//! COMP peripherals
/* COMP basic address definition */
#define     CMPCR1_ADDR     0xE6u
#define     CMPCR2_ADDR     0xE7u

/* CMPCR1 offset */
#define     CMPEN           0x80u
#define     CMPIF           0x40u
#define     PIE             0x20u
#define     NIE             0x10u
#define     PIS             0x08u
#define     NIS             0x04u
#define     CMPOE           0x02u
#define     CMPRES          0x01u

/* CMPAR2 offset */
#define     INVCMPO         0x80
#define     DISFLT          0x40

sfr CMPCR1      =   CMPCR1_ADDR;
sfr CMPCR2      =   CMPCR2_ADDR;

//! EEPROM peripherals
/* EEPROM basic address definition */
#define     IAP_DATA_ADDR   0xC2u
#define     IAP_ADDRH_ADDR  0xC3u
#define     IAP_ADDRL_ADDR  0xC4u
#define     IAP_CMD_ADDR    0xC5u
#define     IAP_TRIG_ADDR   0xC6u
#define     IAP_CONTR_ADDR  0xC7u

/* IAP_CONTR offset */
#define     IAPEN           0x80u
#define     SWBS            0x40u
#define     SWRST           0x20u
#define     CMD_FAIL        0x10u

/* IAP special function registers */
sfr IAP_DATA    =   IAP_DATA_ADDR;
sfr IAP_ADDRH   =   IAP_ADDRH_ADDR;
sfr IAP_ADDRL   =   IAP_ADDRL_ADDR;
sfr IAP_CMD     =   IAP_CMD_ADDR;
sfr IAP_TRIG    =   IAP_TRIG_ADDR;
sfr IAP_CONTR   =   IAP_CONTR_ADDR;

//! ADC peripherals
/* ADC basic address definition */
#define     ADC_CONTR_ADDR  0xBCu
#define     ADC_RESH_ADDR   0xBDu
#define     ADC_RESL_ADDR   0xBEu
#define     ADCCFG_ADDR     0xDEu

/* ADC_CONTR offset */
#define     ADC_POWER       0x80u
#define     ADC_START       0x40u
#define     ADC_FLAG        0x20u

/* ADCCFG offset */
#define     ADC_RESFMT      0x20u

/* ADC special function registers */
sfr ADC_CONTR   =   ADC_CONTR_ADDR;
sfr ADC_RESH    =   ADC_RESH_ADDR;
sfr ADC_RESL    =   ADC_RESL_ADDR;
sfr ADCCFG      =   ADCCFG_ADDR;

//! PCA peripherals
/* PCA basic address definition */
#define     CCON_ADDR       0xD8u
#define     CMOD_ADDR       0xD9u
#define     CL_ADDR         0xE9u
#define     CH_ADDR         0xF9u
#define     CCAPM0_ADDR     0xDAu
#define     CCAPM1_ADDR     0xDBu
#define     CCAPM2_ADDR     0xDCu
#define     CCAPM3_ADDR     0xDDu
#define     CCAP0L_ADDR     0xEAu
#define     CCAP1L_ADDR     0xEBu
#define     CCAP2L_ADDR     0xECu
#define     CCAP3L_ADDR     0xEDu
#define     CCAP0H_ADDR     0xFAu
#define     CCAP1H_ADDR     0xFBu
#define     CCAP2H_ADDR     0xFCu
#define     CCAP3H_ADDR     0xFDu
#define     PCA_PWM0_ADDR   0xF2u
#define     PCA_PWM1_ADDR   0xF3u
#define     PCA_PWM2_ADDR   0xF4u
#define     PCA_PWM3_ADDR   0xF5u

/* CMOD offset */
#define     CIDL            0x80u
#define     ECF             0x01u

/* CCAPM0 offset */
#define     ECOM0           0x40u
#define     CCAPP0          0x20u
#define     CCAPN0          0x10u
#define     MAT0            0x08u
#define     TOG0            0x04u
#define     PWM0            0x02u
#define     ECCF0           0x01u

/* CCAPM1 offset */
#define     ECOM1           0x40u
#define     CCAPP1          0x20u
#define     CCAPN1          0x10u
#define     MAT1            0x08u
#define     TOG1            0x04u
#define     PWM1            0x02u
#define     ECCF1           0x01u

/* CCAMP2 offset */
#define     ECOM2           0x40u
#define     CCAPP2          0x20u
#define     CCAPN2          0x10u
#define     MAT2            0x08u
#define     TOG2            0x04u
#define     PWM2            0x02u
#define     ECCF2           0x01u

/* CCAPM3 offset */
#define     ECOM3           0x40u
#define     CCAPP3          0x20u
#define     CCAPN3          0x10u
#define     MAT3            0x08u
#define     TOG3            0x04u
#define     PWM3            0x02u
#define     ECCF3           0x01u

/* PCA special function registers */
sfr CCON        =   CCON_ADDR;
sfr CMOD        =   CMOD_ADDR;
sfr CL          =   CL_ADDR;
sfr CH          =   CH_ADDR;
sfr CCAPM0      =   CCAPM0_ADDR;
sfr CCAPM1      =   CCAPM1_ADDR;
sfr CCAPM2      =   CCAPM2_ADDR;
sfr CCAPM3      =   CCAPM3_ADDR;
sfr CCAP0L      =   CCAP0L_ADDR;
sfr CCAP1L      =   CCAP1L_ADDR;
sfr CCAP2L      =   CCAP2L_ADDR;
sfr CCAP3L      =   CCAP3L_ADDR;
sfr CCAP0H      =   CCAP0H_ADDR;
sfr CCAP1H      =   CCAP1H_ADDR;
sfr CCAP2H      =   CCAP2H_ADDR;
sfr CCAP3H      =   CCAP3H_ADDR;
sfr PCA_PWM0    =   PCA_PWM0_ADDR;
sfr PCA_PWM1    =   PCA_PWM1_ADDR;
sfr PCA_PWM2    =   PCA_PWM2_ADDR;
sfr PCA_PWM3    =   PCA_PWM3_ADDR;

/* CCON BITs */
sbit CF         =   CCON^7;
sbit CR         =   CCON^6;
sbit CCF3       =   CCON^3;
sbit CCF2       =   CCON^2;
sbit CCF1       =   CCON^1;
sbit CCF0       =   CCON^0;

//! PWM peripherals
/* PWM basic address definition */
#define     PWMCFG_ADDR     0xF1u
#define     PWMIF_ADDR      0xF6u
#define     PWMFDCR_ADDR    0xF7u
#define     PWMCR_ADDR      0xFEu

#define     PWM_BASE        0xFFF0u
#define     PWM0_BASE       0xFF00u
#define     PWM1_BASE       0xFF10u
#define     PWM2_BASE       0xFF20u
#define     PWM3_BASE       0xFF30u
#define     PWM4_BASE       0xFF40u
#define     PWM5_BASE       0xFF50u
#define     PWM6_BASE       0xFF60u
#define     PWM7_BASE       0xFF70u

#define     PWMC_ADDR       (PWM_BASE + 0x00u)
#define     PWMCH_ADDR      (PWMC_ADDR +  0x00u)
#define     PWMCL_ADDR      (PWMCH_ADDR + 0x01u)
#define     PWMCKS_ADDR     (PWMCL_ADDR + 0x01u)

