HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8ax.h
#define     TADCP_ADDR      (PWMCKS_ADDR + 0x01u)
#define     TADCPH_ADDR     (TADCP_ADDR +  0x00u)
#define     TADCPL_ADDR     (TADCPH_ADDR + 0x01u)

#define     PWM0T1_ADDR     (PWM0_BASE + 0x00u)
#define     PWM0T1H_ADDR    (PWM0T1_ADDR +  0x00u)
#define     PWM0T1L_ADDR    (PWM0T1H_ADDR + 0x01u)
#define     PWM0T2_ADDR     (PWM0T1L_ADDR + 0x01u)
#define     PWM0T2H_ADDR    (PWM0T2_ADDR +  0x00u)
#define     PWM0T2L_ADDR    (PWM0T2H_ADDR + 0x01u)
#define     PWM0CR_ADDR     (PWM0T2L_ADDR + 0x01u)
#define     PWM0HLD_ADDR    (PWM0CR_ADDR +  0x01u)

#define     PWM1T1_ADDR     (PWM1_BASE + 0x00u)
#define     PWM1T1H_ADDR    (PWM1T1_ADDR +  0x00u)
#define     PWM1T1L_ADDR    (PWM1T1H_ADDR + 0x01u)
#define     PWM1T2_ADDR     (PWM1T1L_ADDR + 0x01u)
#define     PWM1T2H_ADDR    (PWM1T2_ADDR +  0x00u)
#define     PWM1T2L_ADDR    (PWM1T2H_ADDR + 0x01u)
#define     PWM1CR_ADDR     (PWM1T2L_ADDR + 0x01u)
#define     PWM1HLD_ADDR    (PWM1CR_ADDR +  0x01u)

#define     PWM2T1_ADDR     (PWM2_BASE + 0x00u)
#define     PWM2T1H_ADDR    (PWM2T1_ADDR +  0x00u)
#define     PWM2T1L_ADDR    (PWM2T1H_ADDR + 0x01u)
#define     PWM2T2_ADDR     (PWM2T1L_ADDR + 0x01u)
#define     PWM2T2H_ADDR    (PWM2T2_ADDR +  0x00u)
#define     PWM2T2L_ADDR    (PWM2T2H_ADDR + 0x01u)
#define     PWM2CR_ADDR     (PWM2T2L_ADDR + 0x01u)
#define     PWM2HLD_ADDR    (PWM2CR_ADDR +  0x01u)

#define     PWM3T1_ADDR     (PWM3_BASE + 0x00u)
#define     PWM3T1H_ADDR    (PWM3T1_ADDR +  0x00u)
#define     PWM3T1L_ADDR    (PWM3T1H_ADDR + 0x01u)
#define     PWM3T2_ADDR     (PWM3T1L_ADDR + 0x01u)
#define     PWM3T2H_ADDR    (PWM3T2_ADDR +  0x00u)
#define     PWM3T2L_ADDR    (PWM3T2H_ADDR + 0x01u)
#define     PWM3CR_ADDR     (PWM3T2L_ADDR + 0x01u)
#define     PWM3HLD_ADDR    (PWM3CR_ADDR +  0x01u)

#define     PWM4T1_ADDR     (PWM4_BASE + 0x00u)
#define     PWM4T1H_ADDR    (PWM4T1_ADDR +  0x00u)
#define     PWM4T1L_ADDR    (PWM4T1H_ADDR + 0x01u)
#define     PWM4T2_ADDR     (PWM4T1L_ADDR + 0x01u)
#define     PWM4T2H_ADDR    (PWM4T2_ADDR +  0x00u)
#define     PWM4T2L_ADDR    (PWM4T2H_ADDR + 0x01u)
#define     PWM4CR_ADDR     (PWM4T2L_ADDR + 0x01u)
#define     PWM4HLD_ADDR    (PWM4CR_ADDR +  0x01u)

#define     PWM5T1_ADDR     (PWM5_BASE + 0x00u)
#define     PWM5T1H_ADDR    (PWM5T1_ADDR +  0x00u)
#define     PWM5T1L_ADDR    (PWM5T1H_ADDR + 0x01u)
#define     PWM5T2_ADDR     (PWM5T1L_ADDR + 0x01u)
#define     PWM5T2H_ADDR    (PWM5T2_ADDR +  0x00u)
#define     PWM5T2L_ADDR    (PWM5T2H_ADDR + 0x01u)
#define     PWM5CR_ADDR     (PWM5T2L_ADDR + 0x01u)
#define     PWM5HLD_ADDR    (PWM5CR_ADDR +  0x01u)

#define     PWM6T1_ADDR     (PWM6_BASE + 0x00u)
#define     PWM6T1H_ADDR    (PWM6T1_ADDR +  0x00u)
#define     PWM6T1L_ADDR    (PWM6T1H_ADDR + 0x01u)
#define     PWM6T2_ADDR     (PWM6T1L_ADDR + 0x01u)
#define     PWM6T2H_ADDR    (PWM6T2_ADDR +  0x00u)
#define     PWM6T2L_ADDR    (PWM6T2H_ADDR + 0x01u)
#define     PWM6CR_ADDR     (PWM6T2L_ADDR + 0x01u)
#define     PWM6HLD_ADDR    (PWM6CR_ADDR +  0x01u)

#define     PWM7T1_ADDR     (PWM7_BASE + 0x00u)
#define     PWM7T1H_ADDR    (PWM7T1_ADDR +  0x00u)
#define     PWM7T1L_ADDR    (PWM7T1H_ADDR + 0x01u)
#define     PWM7T2_ADDR     (PWM7T1L_ADDR + 0x01u)
#define     PWM7T2H_ADDR    (PWM7T2_ADDR +  0x00u)
#define     PWM7T2L_ADDR    (PWM7T2H_ADDR + 0x01u)
#define     PWM7CR_ADDR     (PWM7T2L_ADDR + 0x01u)
#define     PWM7HLD_ADDR    (PWM7CR_ADDR +  0x01u)

/* PWMCFG offset */
#define     CBIF            0x80u
#define     ETADC           0x40u

/* PWMIF offset */
#define     C7IF            0x80u
#define     C6IF            0x40u
#define     C5IF            0x20u
#define     C4IF            0x10u
#define     C3IF            0x08u
#define     C2IF            0x04u
#define     C1IF            0x02u
#define     C0IF            0x01u

/* PWMFDCR offset */
#define     INVCMP          0x80u
#define     INVIO           0x40u
#define     ENFD            0x20u
#define     FLTFLIO         0x10u
#define     EFDI            0x08u
#define     FDCMP           0x04u
#define     FDIO            0x02u
#define     FDIF            0x01u

/* PWMCR offset */
#define     ENPWM           0x80u
#define     ECBI            0x40u

/* PWM special function registers */
sfr PWMCFG      =   PWMCFG_ADDR;
sfr PWMIF       =   PWMIF_ADDR;
sfr PWMFDCR     =   PWMFDCR_ADDR;
sfr PWMCR       =   PWMCR_ADDR;

#define     PWMC            (*(__IO uint16_t xdata *) PWMC_ADDR)
#define     PWMCH           (*(__IO uint8_t xdata *)  PWMCH_ADDR)
#define     PWMCL           (*(__IO uint8_t xdata *)  PWMCL_ADDR)
#define     PWMCKS          (*(__IO uint8_t xdata *)  PWMCKS_ADDR)
#define     TADCP           (*(__IO uint8_t xdata *)  TADCP_ADDR)
#define     TADCPH          (*(__IO uint8_t xdata *)  TADCPH_ADDR)
#define     TADCPL          (*(__IO uint8_t xdata *)  TADCPL_ADDR)

#define     PWMxT1(PWMxT1_ADDR)      ( *(__IO uint16_t xdata *) PWMxT1_ADDR)
#define     PWMxT2(PWMxT2_ADDR)      ( *(__IO uint16_t xdata *) PWMxT2_ADDR)
#define     PWMxCR(PWMxCR_ADDR)      ( *(__IO uint8_t  xdata *) PWMxCR_ADDR)
#define     PWMxHLD(PWMxHLD_ADDR)    ( *(__IO uint8_t  xdata *)PWMxHLD_ADDR)

#define     PWM0T1          (*(__IO uint16_t xdata *) PWM0T1_ADDR)
#define     PWM0T1H         (*(__IO uint8_t  xdata *) PWM0T1H_ADDR)
#define     PWM0T1L         (*(__IO uint8_t  xdata *) PWM0T1L_ADDR)
#define     PWM0T2          (*(__IO uint16_t xdata *) PWM0T2_ADDR)
#define     PWM0T2H         (*(__IO uint8_t  xdata *) PWM0T2H_ADDR)
#define     PWM0T2L         (*(__IO uint8_t  xdata *) PWM0T2L_ADDR)
#define     PWM0CR          (*(__IO uint8_t  xdata *) PWM0CR_ADDR)
#define     PWM0HLD         (*(__IO uint8_t  xdata *) PWM0HLD_ADDR)

#define     PWM1T1          (*(__IO uint16_t xdata *) PWM1T1_ADDR)
#define     PWM1T1H         (*(__IO uint8_t  xdata *) PWM1T1H_ADDR)
#define     PWM1T1L         (*(__IO uint8_t  xdata *) PWM1T1L_ADDR)
#define     PWM1T2          (*(__IO uint16_t xdata *) PWM1T2_ADDR)
#define     PWM1T2H         (*(__IO uint8_t  xdata *) PWM1T2H_ADDR)
#define     PWM1T2L         (*(__IO uint8_t  xdata *) PWM1T2L_ADDR)
#define     PWM1CR          (*(__IO uint8_t  xdata *) PWM1CR_ADDR)
#define     PWM1HLD         (*(__IO uint8_t  xdata *) PWM1HLD_ADDR)

