HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8ax.h
#define     PWM2T1          (*(__IO uint16_t xdata *) PWM2T1_ADDR)
#define     PWM2T1H         (*(__IO uint8_t  xdata *) PWM2T1H_ADDR)
#define     PWM2T1L         (*(__IO uint8_t  xdata *) PWM2T1L_ADDR)
#define     PWM2T2          (*(__IO uint16_t xdata *) PWM2T2_ADDR)
#define     PWM2T2H         (*(__IO uint8_t  xdata *) PWM2T2H_ADDR)
#define     PWM2T2L         (*(__IO uint8_t  xdata *) PWM2T2L_ADDR)
#define     PWM2CR          (*(__IO uint8_t  xdata *) PWM2CR_ADDR)
#define     PWM2HLD         (*(__IO uint8_t  xdata *) PWM2HLD_ADDR)

#define     PWM3T1          (*(__IO uint16_t xdata *) PWM3T1_ADDR)
#define     PWM3T1H         (*(__IO uint8_t  xdata *) PWM3T1H_ADDR)
#define     PWM3T1L         (*(__IO uint8_t  xdata *) PWM3T1L_ADDR)
#define     PWM3T2          (*(__IO uint16_t xdata *) PWM3T2_ADDR)
#define     PWM3T2H         (*(__IO uint8_t  xdata *) PWM3T2H_ADDR)
#define     PWM3T2L         (*(__IO uint8_t  xdata *) PWM3T2L_ADDR)
#define     PWM3CR          (*(__IO uint8_t  xdata *) PWM3CR_ADDR)
#define     PWM3HLD         (*(__IO uint8_t  xdata *) PWM3HLD_ADDR)

#define     PWM4T1          (*(__IO uint16_t xdata *) PWM4T1_ADDR)
#define     PWM4T1H         (*(__IO uint8_t  xdata *) PWM4T1H_ADDR)
#define     PWM4T1L         (*(__IO uint8_t  xdata *) PWM4T1L_ADDR)
#define     PWM4T2          (*(__IO uint16_t xdata *) PWM4T2_ADDR)
#define     PWM4T2H         (*(__IO uint8_t  xdata *) PWM4T2H_ADDR)
#define     PWM4T2L         (*(__IO uint8_t  xdata *) PWM4T2L_ADDR)
#define     PWM4CR          (*(__IO uint8_t  xdata *) PWM4CR_ADDR)
#define     PWM4HLD         (*(__IO uint8_t  xdata *) PWM4HLD_ADDR)

#define     PWM5T1          (*(__IO uint16_t xdata *) PWM5T1_ADDR)
#define     PWM5T1H         (*(__IO uint8_t  xdata *) PWM5T1H_ADDR)
#define     PWM5T1L         (*(__IO uint8_t  xdata *) PWM5T1L_ADDR)
#define     PWM5T2          (*(__IO uint16_t xdata *) PWM5T2_ADDR)
#define     PWM5T2H         (*(__IO uint8_t  xdata *) PWM5T2H_ADDR)
#define     PWM5T2L         (*(__IO uint8_t  xdata *) PWM5T2L_ADDR)
#define     PWM5CR          (*(__IO uint8_t  xdata *) PWM5CR_ADDR)
#define     PWM5HLD         (*(__IO uint8_t  xdata *) PWM5HLD_ADDR)

#define     PWM6T1          (*(__IO uint16_t xdata *) PWM6T1_ADDR)
#define     PWM6T1H         (*(__IO uint8_t  xdata *) PWM6T1H_ADDR)
#define     PWM6T1L         (*(__IO uint8_t  xdata *) PWM6T1L_ADDR)
#define     PWM6T2          (*(__IO uint16_t xdata *) PWM6T2_ADDR)
#define     PWM6T2H         (*(__IO uint8_t  xdata *) PWM6T2H_ADDR)
#define     PWM6T2L         (*(__IO uint8_t  xdata *) PWM6T2L_ADDR)
#define     PWM6CR          (*(__IO uint8_t  xdata *) PWM6CR_ADDR)
#define     PWM6HLD         (*(__IO uint8_t  xdata *) PWM6HLD_ADDR)

#define     PWM7T1          (*(__IO uint16_t xdata *) PWM7T1_ADDR)
#define     PWM7T1H         (*(__IO uint8_t  xdata *) PWM7T1H_ADDR)
#define     PWM7T1L         (*(__IO uint8_t  xdata *) PWM7T1L_ADDR)
#define     PWM7T2          (*(__IO uint16_t xdata *) PWM7T2_ADDR)
#define     PWM7T2H         (*(__IO uint8_t  xdata *) PWM7T2H_ADDR)
#define     PWM7T2L         (*(__IO uint8_t  xdata *) PWM7T2L_ADDR)
#define     PWM7CR          (*(__IO uint8_t  xdata *) PWM7CR_ADDR)
#define     PWM7HLD         (*(__IO uint8_t  xdata *) PWM7HLD_ADDR)

//! SPI peripherals
/* SPI basic address definition */
#define     SPSTAT_ADDR     0xCD
#define     SPCTL_ADDR      0xCE
#define     SPDAT_ADDR      0xCF

/* Bit definition for SPSTAT */
#define     SPIF            0x80
#define     WCOL            0x40

/* SPCTL offset */
#define     SSIG            0x80
#define     SPEN            0x40
#define     DORD            0x20
#define     MSTR            0x10
#define     CPOL            0x08
#define     CPHA            0x04

/* SPI special function registers */
sfr SPSTAT      =   SPSTAT_ADDR;
sfr SPCTL       =   SPCTL_ADDR;
sfr SPDAT       =   SPDAT_ADDR;


//! I2C peripherals

/* Base address */
#define     I2C_BASE         0xFE80u
#define     I2CCFG_ADDR   (I2C_BASE + 0x00U)
#define     I2CMSCR_ADDR  (I2C_BASE + 0x01U)
#define     I2CMSST_ADDR  (I2C_BASE + 0x02U)
#define     I2CSLCR_ADDR  (I2C_BASE + 0x03U)
#define     I2CSLST_ADDR  (I2C_BASE + 0x04U)
#define     I2CSLADR_ADDR (I2C_BASE + 0x05U)
#define     I2CTXD_ADDR   (I2C_BASE + 0x06U)
#define     I2CRXD_ADDR   (I2C_BASE + 0x07U)

/* I2CCFG */
#define     ENI2C           0x80u
#define     MSSL            0x40u

/* I2CMSCR offset */
#define     EMSI            0x80u

/* I2CMSST offset */
#define     MSBUSY          0x80u
#define     MSIF            0x40u
#define     MSACKI          0x02u
#define     MSACKO          0x01u

/* I2CSLCR offset */
#define     ESTAI           0x40u
#define     ERXI            0x20u
#define     ETXI            0x10u
#define     ESTOI           0x08u
#define     SLRST           0x01u

/* I2CSLST offset */
#define     SLBUSY          0x80u
#define     STAIF           0x40u
#define     RXIF            0x20u
#define     TXIF            0x10u
#define     STOIF           0x08u
#define     TXING           0x04u
#define     SLACKI          0x02u
#define     SLACKO          0x01u

/* I2C special function registers */
#define     I2CCFG          (*(__IO uint8_t xdata *) I2CCFG_ADDR)
#define     I2CMSCR         (*(__IO uint8_t xdata *) I2CMSCR_ADDR)
#define     I2CMSST         (*(__IO uint8_t xdata *) I2CMSST_ADDR)
#define     I2CSLCR         (*(__IO uint8_t xdata *) I2CSLCR_ADDR)
#define     I2CSLST         (*(__IO uint8_t xdata *) I2CSLST_ADDR)
#define     I2CSLADR        (*(__IO uint8_t xdata *) I2CSLADR_ADDR)
#define     I2CTXD          (*(__IO uint8_t xdata *) I2CTXD_ADDR)
#define     I2CRXD          (*(__IO uint8_t xdata *) I2CRXD_ADDR)


/** @} */

/** @} */

/** @} */

#endif

